; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v4 - type_3 ?v3 - type_1)
 	      (pred_4 ?v7 - object ?v3 - type_1)
	      (pred_2 ?v4 - type_3 ?v1 - type_2)
	      (pred_1 ?v4 - type_3 ?v7 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v4 - type_3 ?v2 ?v8 - type_1)
       :precondition (and  (pred_3 ?v4 ?v2))
       :effect (and  (pred_3 ?v4 ?v8)
		     (not (pred_3 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_3 ?v5 - object ?v6 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v6) (pred_3 ?v4 ?v6) (pred_2 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v5 ?v1)
		    (not (pred_4 ?v5 ?v6)) 
		    (not (pred_2 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_3 ?v5 - object ?v6 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v5 ?v1) (pred_3 ?v4 ?v6))
       :effect (and (pred_4 ?v5 ?v6)
		    (pred_2 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_05 - type_3
obj_13 obj_07 obj_02 obj_06 - type_2
obj_11 obj_01 obj_04 obj_09 - type_1
obj_12 obj_03 obj_08 - object)
(:init
(pred_3 obj_10 obj_04)
(pred_2 obj_10 obj_13)
(pred_2 obj_10 obj_07)
(pred_3 obj_05 obj_11)
(pred_2 obj_05 obj_02)
(pred_2 obj_05 obj_06)
(pred_4 obj_12 obj_09)
(pred_4 obj_03 obj_11)
(pred_4 obj_08 obj_01)
)
(:goal
(and
(pred_4 obj_12 obj_11)
(pred_4 obj_03 obj_04)
(pred_4 obj_08 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_10 obj_09)))
)
)

; plan
1. (op_2 obj_05 obj_03 obj_11 obj_06)
   deleted: (pred_4 obj_03 obj_11) (pred_2 obj_05 obj_06)
   added: (pred_1 obj_05 obj_03 obj_06)
   goals met: 0 of 3
2. (op_3 obj_10 obj_04 obj_01)
   deleted: (pred_3 obj_10 obj_04)
   added: (pred_3 obj_10 obj_01)
   goals met: 0 of 3
3. (op_3 obj_05 obj_11 obj_04)
   deleted: (pred_3 obj_05 obj_11)
   added: (pred_3 obj_05 obj_04)
   goals met: 0 of 3
4. (op_2 obj_10 obj_08 obj_01 obj_07)
   deleted: (pred_4 obj_08 obj_01) (pred_2 obj_10 obj_07)
   added: (pred_1 obj_10 obj_08 obj_07)
   goals met: 0 of 3
5. (op_1 obj_05 obj_03 obj_04 obj_06)
   deleted: (pred_1 obj_05 obj_03 obj_06)
   added: (pred_4 obj_03 obj_04) (pred_2 obj_05 obj_06)
   goals met: 1 of 3
6. (op_3 obj_10 obj_01 obj_11)
   deleted: (pred_3 obj_10 obj_01)
   added: (pred_3 obj_10 obj_11)
   goals met: 1 of 3
7. (op_3 obj_05 obj_04 obj_09)
   deleted: (pred_3 obj_05 obj_04)
   added: (pred_3 obj_05 obj_09)
   goals met: 1 of 3
8. (op_1 obj_10 obj_08 obj_11 obj_07)
   deleted: (pred_1 obj_10 obj_08 obj_07)
   added: (pred_4 obj_08 obj_11) (pred_2 obj_10 obj_07)
   goals met: 2 of 3
9. (op_2 obj_05 obj_12 obj_09 obj_06)
   deleted: (pred_4 obj_12 obj_09) (pred_2 obj_05 obj_06)
   added: (pred_1 obj_05 obj_12 obj_06)
   goals met: 2 of 3
10. (op_3 obj_05 obj_09 obj_11)
   deleted: (pred_3 obj_05 obj_09)
   added: (pred_3 obj_05 obj_11)
   goals met: 2 of 3
11. (op_1 obj_05 obj_12 obj_11 obj_06)
   deleted: (pred_1 obj_05 obj_12 obj_06)
   added: (pred_4 obj_12 obj_11) (pred_2 obj_05 obj_06)
   goals met: 3 of 3
